init_el.org
*** pdf(skim)
    #+begin_src emacs-lisp :tangle "~/.emacs.d/helpers/skim.el"
      ;;; Public Domain by Stian Haklev 2014
      ;;; heavily under construction, mostly built for my own use, but
      ;;; feel free to improve and make more general
      ;;; I keep all my academic PDFs in the same directory, and want special
      ;;; handling for them - eventually I'll check if the PDF is in that dir
      ;;; and if not, I'll insert the whole path in the org-link etc.

      ;;; based on https://github.com/houshuang/skim-emacs/blob/master/skim.el

      (require 'org-mac-link)

      (defun skim-page (&optional offset)
	(interactive)
	(when (not offset) (setq offset 1))
	(do-applescript (format "
      tell document 1 of application \"Skim\" to set a to index of current page
      tell document 1 of application \"Skim\" to go to page (a + %d)
      a" offset)))

      (defun skim-page-absolute (offset)
	(interactive)
	(do-applescript (format "
      tell document 1 of application \"Skim\" to set a to index of current page
      tell document 1 of application \"Skim\" to go to page %d
      a" offset)))

      (defun skim-goto (page)
	(interactive "nPDF Page: ")
	(skim-page-absolute page))
      ;; (defun skim-get-highlights ()
      ;;   (interactive)
      ;;   (insert (do-applescript "
      ;; tell application \"Skim\"
      ;; 	set pageNotes to notes of page 3 of document 1
      ;; 	set out to \"\"
      ;; 	repeat with i in pageNotes
      ;; 		set txt to get text of i
      ;; 		set out to out & txt & \"\n\n\"
      ;; 	end repeat
      ;; end tell
      ;; out")))

      (defun skim-current-page ()
	(interactive)
	(skim-page 0))

      (defun skim-current-file ()
	(interactive)
	(do-applescript "tell document 1 of application \"Skim\" to set a to name
      a"))

      (defun skim-next-page ()
	(interactive)
	(skim-page 1))

      (defun skim-prev-page ()
	(interactive)
	(skim-page -1))

      (defun skim-kill-other-windows ()
	(interactive)
	(do-applescript "
      tell application \"Skim\"
	      set mainID to id of front window
	      -- insert your code
	      close (every window whose id ≠ mainID)
      end tell"))

      (defun open-link-in-skim ()
	(interactive)
	(let ((link (org-element-context)))
	  (if (string-equal (org-element-property :type link) "skim")
	      (progn
		(org-mac-skim-open (org-element-property :path link))
		(skim-kill-other-windows)
		(sleep-for 0 100)
		(do-applescript "tell application \"Emacs\" to activate"))
	    (message "It's not a skim link !!!"))))


      (defun skim-insert-book-link ()
	(interactive)
	(insert (skim-book-link)))

      (defun skim-insert-page-link ()
	(interactive)
	(insert (skim-page-link-without-book-name)))

      (defun skim-book-link ()
	"get book link into org with page 1 and description don't contain page number"
	(let* ((link-and-descr (as-get-skim-page-link))
	       (split-link (split-string link-and-descr "::split::"))
	       (link (car split-link))
	       (description (cadr split-link))
	       (book-link (concat (link-to-book link) "::1"))
	       (book-name (book-name description))
	       (org-link))
	  (when (not (string= link ""))
	    (setq org-link (org-link-make-string book-link book-name)))
	  (kill-new org-link)
	  org-link))

      (defun skim-page-link-without-book-name ()
	"only get page link with page number as description (without book name)"
	(let* ((link-and-descr (as-get-skim-page-link))
	       (split-link (split-string link-and-descr "::split::"))
	       (link (car split-link))
	       (description (cadr split-link))
	       (page-number (concat "p." (page-number description)))
	       (org-link))
	  (when (not (string= link ""))
	    (setq org-link (org-link-make-string link page-number)))
	  (kill-new org-link)
	  org-link))

      (defun link-to-book (link)
	(s-join "" (reverse (cdr (reverse (split-string link "::"))))))

      (defun page-number (description)
	(car (reverse (split-string description ", p\\."))))

      (defun book-name (description)
	(s-join "" (reverse (cdr (reverse (split-string description ", p\\."))))))

      (provide 'skim)
    #+end_src
*** DONE 设置翻页快捷键
    - State "DONE"       from "TODO"       [2021-11-14 Sun 21:55]
    检测当前是否有 nov buffer ，如果有，则执行 nov 翻页，否则执行 skim 翻页。
    #+begin_src emacs-lisp
      (require 'skim)

      (defun nov-buffer-in-current ()
	(cl-find-if
	 (lambda (window)
	   (with-current-buffer (window-buffer window) (eq major-mode 'nov-mode)))
	 (window-list)))

      (defun reader/scroll-up (arg)
	(interactive "P")
	(let ((nov-window (nov-buffer-in-current))
	      (current-window (get-buffer-window)))
	  (if nov-window
	      (progn
		(select-window nov-window)
		(nov-scroll-up arg)
		(select-window current-window))
	    (skim-next-page))))

      (defun reader/scroll-down (arg)
	(interactive "P")
	(let ((nov-window (nov-buffer-in-current))
	      (current-window (get-buffer-window)))
	  (if nov-window
	      (progn
		(select-window nov-window)
		(nov-scroll-down arg)
		(select-window current-window))
	    (skim-prev-page))))

      (defun reader/goto-pdf-first-page-or-nov-toc ()
	(interactive)
	(let ((nov-window (nov-buffer-in-current))
	      (current-window (get-buffer-window)))
	  (if nov-window
	      (progn
		(select-window nov-window)
		(nov-goto-toc)
		(select-window current-window))
	    (skim-goto 1))))

    #+end_src
** Helpers
*** tab 循环展开图片
    #+begin_src emacs-lisp
      ;;; Only display inline images under current subtree.
      (defun org-display-subtree-inline-images (&optional state)
	"Toggle the display of inline images under current subtree.
      INCLUDE-LINKED is passed to `org-display-inline-images'."
	(interactive)
	(save-excursion
	  (save-restriction
	    (org-narrow-to-subtree)
	    (let* ((beg (point-min))
		   (end (point-max))
		   (image-overlays (cl-intersection
				    org-inline-image-overlays
				    (overlays-in beg end)))
		   (display-inline-images-local
		    (lambda ()
		      (org-display-inline-images t t beg end)
		      (setq image-overlays (cl-intersection
					    org-inline-image-overlays
					    (overlays-in beg end)))
		      (if (and (org-called-interactively-p) image-overlays)
			  (message "%d images displayed inline"
				   (length image-overlays)))))
		   (hide-inline-images-local
		    (lambda ()
		      (org-remove-inline-images)
		      (message "Inline image display turned off"))))
	      (if state
		  (pcase state
		    ('subtree
		     (funcall display-inline-images-local))
		    ('folded
		     (funcall hide-inline-images-local)))
		(if image-overlays
		    (funcall display-inline-images-local)
		  (funcall hide-inline-images-local)))))))
    #+end_src

*** 循环展开 properties
    #+begin_src emacs-lisp
      (defun org-hide-properties ()
	"Hide all org-mode headline property drawers in buffer. Could be slow if it has a lot of overlays."
	(interactive)
	(save-excursion
	  (goto-char (point-min))
	  (while (re-search-forward
		  "^ *:properties:\n\\( *:.+?:.*\n\\)+ *:end:\n" nil t)
	    (let ((ov_this (make-overlay (match-beginning 0) (match-end 0))))
	      (overlay-put ov_this 'display "")
	      (overlay-put ov_this 'hidden-prop-drawer t))))
	(put 'org-toggle-properties-hide-state 'state 'hidden))

      (defun org-show-properties ()
	"Show all org-mode property drawers hidden by org-hide-properties."
	(interactive)
	(remove-overlays (point-min) (point-max) 'hidden-prop-drawer t)
	(put 'org-toggle-properties-hide-state 'state 'shown))

      (defun org-toggle-properties ()
	"Toggle visibility of property drawers."
	(interactive)
	(if (eq (get 'org-toggle-properties-hide-state 'state) 'hidden)
	    (org-show-properties)
	  (org-hide-properties)))
    #+end_src

*** mac 通知
依赖于终端软件 =terminal-notifier= 。
#+begin_src emacs-lisp
  (defun notify-osx (title message)
  (call-process "terminal-notifier"
                nil 0 nil
                "-group" "Emacs"
                "-title" title
                "-sender" "org.gnu.Emacs"
                "-mesage" message
                "-activate" "org.gnu.Emacs"))
#+end_src
** Org-babel
*** elixir
    #+begin_src emacs-lisp
      (use-package ob-elixir :after org)
    #+end_src
** 本体
   #+begin_src emacs-lisp
	  (use-package org
	    :ensure org-plus-contrib
	    :ensure-system-package terminal-notifier
	    :pin nongnu
	    :defer t
	    :init
	    (org-babel-do-load-languages
	     'org-babel-load-languages
	     '((emacs-lisp . t)
	       (elixir . t)
	       (org . t)
	       (haskell . t)
	       (lisp . t)))
	    ;;(R . t)))
	    :config
	  ;;; auto display inline images on Org TAB cycle expand headlines.
	    ;; (add-hook 'org-mode-hook 'scimax-src-keymap-mode)
	    (add-hook 'org-cycle-hook #'org-display-subtree-inline-images)
	    (add-to-list 'org-export-backends 'md)
	    (setq org-todo-keywords '((sequence "TODO(t/!)" "WAIT(w/!)" "|" "DONE(d/!)" "DELEGATED(g@)" "CANCELED(c@)"))
		  ;; org-default-notes-file org-agenda-file
		  org-archive-location (concat org-directory "Archived/" "%s_archive::")
		  org-id-locations-file (concat org-directory ".org-id-locations")
		  org-log-done nil
		  ;; (nconc org-modules '(org-id))
		  ;; org-refile-targets '((org-agenda-files :maxlevel . 2))
		  org-refile-use-outline-path 'file
		  org-outline-path-complete-in-steps nil
		  org-refile-allow-creating-parent-nodes 'confirm
		  org-refile-use-cache t
		  org-startup-truncated nil
		  org-confirm-babel-evaluate nil
		  org-M-RET-may-split-line '((headline . nil) (item . nil) (default . t))
		  org-html-validation-link nil)
	    ;; refresh cache when emacs idle 5 mins
	    (run-with-idle-timer 300 t (lambda ()
					 (org-refile-cache-clear)
					 ;; (org-refile-get-targets)
					 (org-roam-db-sync))))
   #+end_src
** 美观
   有时候反而觉得原始状态挺好看。。。而且这个插件极度影响性能。。。所以先禁止掉。
   #+begin_src emacs-lisp :tangle no
     (use-package org-bullets
       :hook (org-mode . org-bullets-mode))
   #+end_src
